code-review/NRB_3471_3546/База_Было/Documents/ЦБВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЦБВПути</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/КлассыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Административные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глобальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ЦБВПути/Forms/ФормаДокумента/Ext/Form/Module.bsl
//#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Если Объект.Проверка Тогда
			Отказ = Истина;
		КонецЕсли;
		 
		УстановитьНомерДокументаСервер(); 
		ЗаполнитьШапкуДокументаСервер();
								
	КонецЕсли;
	
	УправлениеДиалогом(ЭтаФорма);
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Объект.Сумма = Объект.Цена * Объект.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Объект.Сумма = Объект.Цена * Объект.Количество;

КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Если Объект.Количество = 0 Тогда
		Объект.Цена = 0;
	Иначе
		Объект.Цена = Объект.Сумма / Объект.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если ЗначениеРеквизитаНаСервере(Объект.СчетДепоПолучатель,"Владелец") <> Объект.Получатель Тогда
		
		Объект.СчетДепоПолучатель = ПредопределенноеЗначение("Справочник.СчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоПолучатель,"Владелец") <> Объект.СчетДепоПолучатель Тогда
		
		РазделСчетаДепоПолучатель = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПолучательПриИзменении(Элемент)
	
	Если ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХПолучатель,"Владелец") <> Объект.МестоХраненияПолучатель Тогда
		
		Объект.СчетДепоМХПолучатель = ПредопределенноеЗначение("Справочник.СчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХПолучатель,"Владелец") <> Объект.СчетДепоМХПолучатель Тогда
		
		Объект.РазделСчетаДепоМХПолучатель = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоПолучательПриИзменении(Элемент)
	
	Если Объект.Получатель = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
		
		Объект.Получатель = ЗначениеРеквизитаНаСервере(Объект.СчетДепоПолучатель,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоПолучатель,"Владелец") <> Объект.СчетДепоПолучатель Тогда
		
		Объект.РазделСчетаДепоПолучатель = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоМХПолучательПриИзменении(Элемент)
	
	Если Объект.МестоХраненияПолучатель = ПредопределенноеЗначение("Справочник.МестаХранения.ПустаяСсылка") Тогда
		
		Объект.МестоХраненияПолучатель = ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХПолучатель,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХПолучатель,"Владелец") <> Объект.СчетДепоМХПолучатель Тогда
		
		Объект.РазделСчетаДепоМХПолучатель = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХПолучательПриИзменении(Элемент)//++
	
	Если Объект.СчетДепоМХПолучатель = ПредопределенноеЗначение("Справочник.СчетаДепоМХ.ПустаяСсылка")  Тогда
		
		СчетДепоМХПолучатель = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХПолучатель,"Владелец");
		
	КонецЕсли;
	
	Владелец = ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХПолучатель,"Владелец");
	Если Объект.МестоХраненияПолучатель <> Владелец Тогда
		
		Объект.МестоХраненияПолучатель = Владелец;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоПолучательПриИзменении(Элемент)
	
	Если Объект.СчетДепоПолучатель = ПредопределенноеЗначение("Справочник.СчетаДепо.ПустаяСсылка") Тогда
		
		Объект.СчетДепоПолучатель = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоПолучатель,"Владелец");
		
	КонецЕсли;
	Владелец = ЗначениеРеквизитаНаСервере( Объект.СчетДепоПолучатель,"Владелец");
	Если Объект.Получатель <> Владелец Тогда
		
		Объект.Получатель = Владелец;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторПриИзменении(Элемент)
	
	Если ЗначениеРеквизитаНаСервере(Объект.СчетДепо,"Владелец") <> Объект.Инициатор Тогда
		
		Объект.СчетДепо = ПредопределенноеЗначение("Справочник.СчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепо,"Владелец") <> Объект.СчетДепо Тогда
		
		Объект.РазделСчетаДепо = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перемещение")
			ИЛИ Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо") Тогда
		
		Объект.Получатель = Объект.Инициатор;
		ПолучательПриИзменении(Элементы.Получатель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	
	Если ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХ,"Владелец") <> Объект.МестоХранения Тогда
		
		Объект.СчетДепоМХ = ПредопределенноеЗначение("Справочник.СчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХ,"Владелец") <> Объект.СчетДепоМХ Тогда
		
		Объект.РазделСчетаДепоМХ = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перевод") Тогда
		
		Объект.МестоХраненияПолучатель = Объект.МестоХранения;
		МестоХраненияПолучательПриИзменении(Элементы.МестоХраненияПолучатель);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоПриИзменении(Элемент)
	
	Если Объект.Инициатор = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда
		
		Объект.Инициатор = ЗначениеРеквизитаНаСервере(Объект.СчетДепо,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепо,"Владелец") <> Объект.СчетДепо Тогда
		
		Объект.РазделСчетаДепо = ПредопределенноеЗначение("Справочник.РазделыСчетаДепо.ПустаяСсылка");
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перемещение") 
			ИЛИ Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо")  Тогда
		
		Объект.СчетДепоПолучатель = Объект.СчетДепо;
		СчетДепоПолучательПриИзменении(Элементы.СчетДепоПолучатель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДепоМХПриИзменении(Элемент)
	
	Если Объект.МестоХранения = ПредопределенноеЗначение("Справочник.МестаХранения.ПустаяСсылка") Тогда
		
		Объект.МестоХранения = ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХ,"Владелец");
		
	КонецЕсли;
	
	Если ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХ,"Владелец") <> Объект.СчетДепоМХ Тогда
		
		Объект.РазделСчетаДепоМХ = ПредопределенноеЗначение("Справочник.РазделыСчетаДепоМХ.ПустаяСсылка");
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перевод") Тогда
		
		Объект.СчетДепоМХПолучатель = Объект.СчетДепоМХ;
		СчетДепоМХПолучательПриИзменении(Элементы.СчетДепоМХПолучатель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоПриИзменении(Элемент)
	
	Если Объект.СчетДепо = ПредопределенноеЗначение("Справочник.СчетаДепо.ПустаяСсылка") Тогда
		
		Объект.СчетДепо = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепо,"Владелец");
		
	КонецЕсли;
	
	Владелец = ЗначениеРеквизитаНаСервере(Объект.СчетДепо,"Владелец");
	Если Объект.Инициатор <> Владелец Тогда
		
		Объект.Инициатор = Владелец;
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перемещение") 
			ИЛИ Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо") Тогда
		
		Объект.РазделСчетаДепоПолучатель = Объект.РазделСчетаДепо;
		РазделСчетаДепоПолучательПриИзменении(Элементы.РазделСчетаДепоПолучатель);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазделСчетаДепоМХПриИзменении(Элемент)
	
	Если Объект.СчетДепоМХ = ПредопределенноеЗначение("Справочник.СчетаДепоМХ.ПустаяСсылка") Тогда
		
		Объект.СчетДепоМХ = ЗначениеРеквизитаНаСервере(Объект.РазделСчетаДепоМХ,"Владелец");
		
	КонецЕсли;
	
	Владелец = ЗначениеРеквизитаНаСервере(Объект.СчетДепоМХ,"Владелец");
	Если Объект.МестоХранения <> Владелец Тогда
		
		Объект.МестоХранения = Владелец;
		
	КонецЕсли;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перевод") Тогда
		
		Объект.РазделСчетаДепоМХПолучатель = Объект.РазделСчетаДепоМХ;
		РазделСчетаДепоМХПолучательПриИзменении(Элементы.РазделСчетаДепоМХПолучатель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(Объект.ДокументОснование) Тогда
		
		ДокументОснованиеПриИзмененииНаСервере();
				
	КонецЕсли;
КонецПроцедуры

&НаСервере  
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	   НашОбъект = РеквизитФормыВЗначение("Объект");
	   НашОбъект.Заполнить(Объект.ДокументОснование);
	   ЗначениеВРеквизитФормы(НашОбъект,"Объект");
	   
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииДПриИзменении(Элемент)
	
//Проверка вида операции
	Если ЗначениеРеквизитаНаСервере(Объект.ВидОперацииД,"КлассОпераций") <> ПредопределенноеЗначение("Перечисление.КлассыОпераций.Инвентарные") Тогда 
		
		Сообщить("Данная операция документом ЦБ в пути не производится!");
		Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПустаяСсылка");
		Возврат;
		
	КонецЕсли;
	
	ВидОперацииДПриИзмененииНаСервере();
	
	УправлениеДиалогом(ЭтаФорма);
	
КонецПроцедуры

&НаСервере 
Процедура ВидОперацииДПриИзмененииНаСервере()
	
	   НашОбъект = РеквизитФормыВЗначение("Объект");
	   НашОбъект.ЗаполнениеРеквизитовПоВидуОперации();                                   
	   ЗначениеВРеквизитФормы(НашОбъект,"Объект");
	   
КонецПроцедуры

&НаКлиенте
Процедура ЦБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(Не ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);

КонецПроцедуры


//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШапкуДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ТекущийОбъект, ПараметрыСеанса.ТекущийПользователь, , );
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерДокументаСервер()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Дата) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ТекущийОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Источник, ИмяРеквизита)
	Перем Результат;
	Если Источник <> Неопределено Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, ИмяРеквизита);
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДиалогом(Форма)
	
	Объект = Форма.Объект;
	ЭлементыФормы = Форма.Элементы;
	
	Если Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Депонирование")  Тогда
		
		ЭлементыФормы.СтраницаПолучатель.Видимость 		= Ложь;
		ЭлементыФормы.Получатель.Доступность					= Истина;
		ЭлементыФормы.СчетДепоПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоПолучатель.Доступность		= Истина;
		ЭлементыФормы.МестоХраненияПолучатель.Доступность		= Истина;
		ЭлементыФормы.СчетДепоМХПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоМХПолучатель.Доступность	= Истина;
		
	ИначеЕсли Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.СнятиеСДепонирования")  Тогда
		
		ЭлементыФормы.СтраницаПолучатель.Видимость 		= Ложь;
		ЭлементыФормы.Получатель.Доступность					= Истина;
		ЭлементыФормы.СчетДепоПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоПолучатель.Доступность		= Истина;
		ЭлементыФормы.МестоХраненияПолучатель.Доступность		= Истина;
		ЭлементыФормы.СчетДепоМХПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоМХПолучатель.Доступность	= Истина;
		
	ИначеЕсли Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перевод") Тогда
		
		ЭлементыФормы.СтраницаПолучатель.Видимость 		= Истина;
		ЭлементыФормы.Получатель.Доступность					= Истина;
		ЭлементыФормы.СчетДепоПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоПолучатель.Доступность		= Истина;
		ЭлементыФормы.МестоХраненияПолучатель.Доступность		= Ложь;
		ЭлементыФормы.СчетДепоМХПолучатель.Доступность			= Ложь;
		ЭлементыФормы.РазделСчетаДепоМХПолучатель.Доступность	= Ложь;
		
	ИначеЕсли Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.Перемещение")
				ИЛИ Объект.ВидОперацииД = ПредопределенноеЗначение("Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо") Тогда
		
		ЭлементыФормы.СтраницаПолучатель.Видимость 		= Истина;
		ЭлементыФормы.Получатель.Доступность					= Ложь;
		ЭлементыФормы.СчетДепоПолучатель.Доступность			= Ложь;
		ЭлементыФормы.РазделСчетаДепоПолучатель.Доступность		= Ложь;
		ЭлементыФормы.МестоХраненияПолучатель.Доступность		= Истина;
		ЭлементыФормы.СчетДепоМХПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоМХПолучатель.Доступность	= Истина;
		
	Иначе
		
		ЭлементыФормы.СтраницаПолучатель.Видимость 		= Истина;
		ЭлементыФормы.Получатель.Доступность					= Истина;
		ЭлементыФормы.СчетДепоПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоПолучатель.Доступность		= Истина;
		ЭлементыФормы.МестоХраненияПолучатель.Доступность		= Истина;
		ЭлементыФормы.СчетДепоМХПолучатель.Доступность			= Истина;
		ЭлементыФормы.РазделСчетаДепоМХПолучатель.Доступность	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()


//#КонецОбласти
